Tekla.Structures.TeklaStructuresFiles
The TeklaStructuresFiles class is for the paths where the attributes file will be searched for.

Tekla.Structures.TeklaStructuresFiles.ProjectEnvVariable
XS_PROJECT environment variable name.

Tekla.Structures.TeklaStructuresFiles.FirmEnvVariable
XS_FIRM environment variable name.

Tekla.Structures.TeklaStructuresFiles.FixedSubDirectories
Fixed subfolders excluded from search.

Tekla.Structures.TeklaStructuresFiles.modelPath
The model path

Tekla.Structures.TeklaStructuresFiles.variablesHelper
The tekla structures variables

Tekla.Structures.TeklaStructuresFiles.directoriesExcludedFromSearch
Fixed folders excluded from search.

Tekla.Structures.TeklaStructuresFiles.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.TeklaStructuresFiles class.
modelpath: The modelpath.

Tekla.Structures.TeklaStructuresFiles.PropertyFileDirectories
The directories where to look for property files.

Tekla.Structures.TeklaStructuresFiles.GetMultiDirectoryFileList(System.String,System.Boolean)
Gets a list of files with the given extension from the default search directories.
fileExtension: The file extension to be used.
fullpath: If true, file with full path with extension is returned.
Returns: A list of files with the given extension.

Tekla.Structures.TeklaStructuresFiles.GetAttributeFile(System.String)
Gets a file info representing the first match in the standard property file directories.
fileName: The name of the file including the file extension.
Returns: A file info for the first match in the directory list. Null if no match was found.

Tekla.Structures.TeklaStructuresFiles.GetAttributeFile(System.Collections.Generic.List{System.String},System.String)
Gets a file info representing the first match in the search directories.
searchDirectories: The list of directories to be used for searching for the file.
fileName: The name of the file including the file extension.
Returns: A file info for the first match in the directory list. Null if no match was found.

Tekla.Structures.TeklaStructuresFiles.IsValidDirectory(System.String)
Checks if a directory is valid.
directory: The directory to be checked.
Returns: True if the directory is valid.

Tekla.Structures.TeklaStructuresFiles.GetMultiDirectoryFileList(System.Collections.Generic.List{System.String},System.String,System.Boolean)
Gets a list of files with the given extension from the given search directories.
searchDirectories: The search directories to be used.
fileExtension: The file extension to be used.
fullpath: If true, file with full path with extension is returned.
Returns: A list of found file names without the file extension.

Tekla.Structures.TeklaStructuresFiles.GetStandardPropertyFileDirectories
Gets the paths where to look for the property files.
Returns: The paths where to look for the property files.

Tekla.Structures.TeklaStructuresFiles.AddPaths(System.Collections.Generic.List{System.String},System.String)
Adds the paths.
fileDirectories: The file directories.
environmentVariableName: Name of the environment variable.

Tekla.Structures.TeklaStructuresFiles.AddSubFolders(System.String,System.Collections.Generic.List{System.String})
Adds subfolders to search directories.
envDirectory: The directory from environment variable.
fileDirectories: The search directories.